# WorksharingTooltipInfo Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksharingTooltipInfo Class
Members See Also
---
Worksharing information about a single element suitable for display in an in-canvas tooltip.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class WorksharingTooltipInfo : IDisposable
```

Visual Basic
---
```text
Public Class WorksharingTooltipInfo _
	Implements IDisposable
```

Visual C++
---
```text
public ref class WorksharingTooltipInfo : IDisposable
```

# Remarks
Some or all of the strings may be empty.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..WorksharingTooltipInfo
# See Also
WorksharingTooltipInfo Members
Autodesk.Revit.DB Namespace